docs/DESIGN.md
```mermaid
classDiagram


class Sensor {
 <<interface>>
 +String sensor_name
 +bool connected
 bool CheckConnection()*
 void Attach()*
 void Update()*
 bool Calibrate()*
 bool Stop()*
}


RCReceiver *-- PWMReceiver
class RCReceiver {
  - PWMReceiver throttle
  - PWMReceiver yaw
  + int ReadThrottle()
  + int ReadYaw()
}

Sensor <|-- PWMReceiver
class PWMReceiver {
  -int pwm_value
  +int ReadRCValue()
}

Sensor <|-- PPMReceiver
class PPMReceiver {
  -int throttle_channel
  -int yaw_channel
  +int ReadThrottle()
  +int ReadYaw()
}

Sensor <|-- BNO055
class BNO055 {
  -int current_heading
  +int GetHeading()
}


Sensor <|-- GPS
class GPS {
  - TinyGPSPlus gps
  - GPSCoordinate current_gps
  + void WaitForGPSConnection()
  + GPSCoordinate GetCurrentGPSCoordinate()
}

GPS o-- GPSCoordinate
class GPSCoordinate {
  - double latitude
  - double longtitude
  + GPS(double lat, double longi)
  + double GetDistanceTo(GPS dest)
  + double GetHeadingTo(GPS dest)
  + double GetDistanceBetween(GPS source, GPS dest)$
  + double GetHeadingBetween(GPS source, GPS dest)$
}


Sensor <|-- Altimeter
class Altimeter {
  - double current_altitude
  + double GetCurrentAltitude()
}

Sensor <|-- Encoder
class Encoder {
  - long current_tick

}


```
